## Pandas

pandas is a powerful Data manipulation library in python widely used for Data abalysis, Data cleaning. It provide two primary data structures: Series and DataFrame. A series is a one dimensional array-like object, while Dataframe is a two dimensional, size-mutable, and potentially heterogenous tabular data structures with labeleld axis(rows and columns)

In [2]:
import pandas as pd

In [3]:
#Series:
#Series is a one dimensional array-like object that can hold any data type. It is similar to column in a table.

data= [1,2,3,4,5]
series= pd.Series(data)
print("Series:", series)

Series: 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#Creating a series from dictionary
data= {'a':1, 'b':2, 'c':3}
Series_dic= pd.Series(data)
print(Series_dic)

a    1
b    2
c    3
dtype: int64

In [5]:
#Another way of giving index manually is
data=[1,2,3]
index= ['a','b','c']
indexed_data= pd.Series(data, index=index)
print(indexed_data)

a    1
b    2
c    3
dtype: int64

In [15]:
#Data Frames:
#Create a Dataframe form the dictionary of list
data= {
    'Name': ["Areeba", "Mahnoor"],
     'Age': [22, 20],
     'city':["Islamabad", "Islamabad"],
  }
df= pd.DataFrame(data)
print(df)

      Name  Age       city
0   Areeba   22  Islamabad
1  Mahnoor   20  Islamabad

In [16]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [17]:
#we can also convert this dataframe into numpy array
import numpy as np
np.array(df)

array([['Areeba', 22, 'Islamabad'],
       ['Mahnoor', 20, 'Islamabad']], dtype=object)

In [19]:
#Now Creating a dataframe from list of dictionaries
data= [
    {'Name': 'Areeba', 'Age': 22, 'City': 'Islamabad'},
    {'Name': 'Mahnoor', 'Age': 20, 'City': 'Islamabad'},
    {'Name': 'Maria', 'Age': 21, 'City': 'Nowshera'},
    {'Name': 'Malaika', 'Age': 23, 'City': 'Peshawar'},
]
df= pd.DataFrame(data)
print(df)

      Name  Age       City
0   Areeba   22  Islamabad
1  Mahnoor   20  Islamabad
2    Maria   21   Nowshera
3  Malaika   23   Peshawar

In [23]:
data= pd.read_csv('buisness_data.csv')
df= pd.DataFrame(data)
print(df)

     Series_reference   Period  Data_value Suppressed STATUS    UNITS  \
0       BDCQ.SF1AA2CA  2016.06    1116.386        NaN      F  Dollars
1       BDCQ.SF1AA2CA  2016.09    1070.874        NaN      F  Dollars
2       BDCQ.SF1AA2CA  2016.12    1054.408        NaN      F  Dollars
3       BDCQ.SF1AA2CA  2017.03    1010.665        NaN      F  Dollars
4       BDCQ.SF1AA2CA  2017.06    1233.700        NaN      F  Dollars
...               ...      ...         ...        ...    ...      ...
8830     BDCQ.SF8RSCA  2024.06     542.409        NaN      F  Dollars
8831     BDCQ.SF8RSCA  2024.09     612.190        NaN      F  Dollars
8832     BDCQ.SF8RSCA  2024.12     643.976        NaN      F  Dollars
8833     BDCQ.SF8RSCA  2025.03     699.681        NaN      F  Dollars
8834     BDCQ.SF8RSCA  2025.06     587.843        NaN      F  Dollars

      Magnitude                         Subject  \
0             6  Business Data Collection - BDC
1             6  Business Data Collection - BDC
2             6  Business Data Collection - BDC
3             6  Business Data Collection - BDC
4             6  Business Data Collection - BDC
...         ...                             ...
8830          6  Business Data Collection - BDC
8831          6  Business Data Collection - BDC
8832          6  Business Data Collection - BDC
8833          6  Business Data Collection - BDC
8834          6  Business Data Collection - BDC

                                                Group  \
0     Industry by financial variable (NZSIOC Level 2)
1     Industry by financial variable (NZSIOC Level 2)
2     Industry by financial variable (NZSIOC Level 2)
3     Industry by financial variable (NZSIOC Level 2)
4     Industry by financial variable (NZSIOC Level 2)
...                                               ...
8830  Industry by financial variable (NZSIOC Level 1)
8831  Industry by financial variable (NZSIOC Level 1)
8832  Industry by financial variable (NZSIOC Level 1)
8833  Industry by financial variable (NZSIOC Level 1)
8834  Industry by financial variable (NZSIOC Level 1)

                Series_title_1                       Series_title_2  \
0     Sales (operating income)                 Forestry and Logging
1     Sales (operating income)                 Forestry and Logging
2     Sales (operating income)                 Forestry and Logging
3     Sales (operating income)                 Forestry and Logging
4     Sales (operating income)                 Forestry and Logging
...                        ...                                  ...
8830          Operating profit  Arts, Recreation and Other Services
8831          Operating profit  Arts, Recreation and Other Services
8832          Operating profit  Arts, Recreation and Other Services
8833          Operating profit  Arts, Recreation and Other Services
8834          Operating profit  Arts, Recreation and Other Services

      Series_title_3 Series_title_4  Series_title_5
0     Current prices     Unadjusted             NaN
1     Current prices     Unadjusted             NaN
2     Current prices     Unadjusted             NaN
3     Current prices     Unadjusted             NaN
4     Current prices     Unadjusted             NaN
...              ...            ...             ...
8830         Current     Unadjusted             NaN
8831         Current     Unadjusted             NaN
8832         Current     Unadjusted             NaN
8833         Current     Unadjusted             NaN
8834         Current     Unadjusted             NaN

[8835 rows x 14 columns]

In [26]:
#if I want to see last 5 records
df.tail()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
8830,BDCQ.SF8RSCA,2024.06,542.409,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
8831,BDCQ.SF8RSCA,2024.09,612.190,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
8832,BDCQ.SF8RSCA,2024.12,643.976,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
8833,BDCQ.SF8RSCA,2025.03,699.681,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
8834,BDCQ.SF8RSCA,2025.06,587.843,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN

In [27]:

#if I want to see the first 5 records
df.head()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SF1AA2CA,2016.06,1116.386,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
1,BDCQ.SF1AA2CA,2016.09,1070.874,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
2,BDCQ.SF1AA2CA,2016.12,1054.408,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
3,BDCQ.SF1AA2CA,2017.03,1010.665,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
4,BDCQ.SF1AA2CA,2017.06,1233.700,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN

In [77]:
#Acceesing data from dataframe

data= [
    {'Name': 'Areeba', 'Age': 22, 'City': 'Islamabad'},
    {'Name': 'Mahnoor', 'Age': 20, 'City': 'Islamabad'},
    {'Name': 'Maria', 'Age': 21, 'City': 'Nowshera'},
    {'Name': 'Malaika', 'Age': 23, 'City': 'Peshawar'},
]
df= pd.DataFrame(data)
df

      Name  Age       City
0   Areeba   22  Islamabad
1  Mahnoor   20  Islamabad
2    Maria   21   Nowshera
3  Malaika   23   Peshawar

In [78]:
print(df['Name']) #Accessing the data from dataframe
type(df['Name']) #When we access a single column from dataframe it automatically becomes a series

0     Areeba
1    Mahnoor
2      Maria
3    Malaika
Name: Name, dtype: object

pandas.core.series.Series

In [79]:
print(df.loc[0]) #it will display everything located at index 0

Name       Areeba
Age            22
City    Islamabad
Name: 0, dtype: object

In [80]:
df.loc[0][0]#it will show the data on row 0 column 0 but will also give a warning

C:\Users\Dell\AppData\Local\Temp\ipykernel_11440\1559598799.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]#it will show the data on row 0 column 0 but will also give a warning

'Areeba'

In [81]:
df.iloc[0][0]

C:\Users\Dell\AppData\Local\Temp\ipykernel_11440\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Areeba'

In [82]:
#Accing a specified elemnts
df['Name']

0     Areeba
1    Mahnoor
2      Maria
3    Malaika
Name: Name, dtype: object

In [83]:
print(df)
print(df.at[1,'Age'])

      Name  Age       City
0   Areeba   22  Islamabad
1  Mahnoor   20  Islamabad
2    Maria   21   Nowshera
3  Malaika   23   Peshawar
20

In [84]:
print(df.at[2,'City'])

Nowshera

In [85]:
df.iat[3,2]

'Peshawar'

In [86]:
df

      Name  Age       City
0   Areeba   22  Islamabad
1  Mahnoor   20  Islamabad
2    Maria   21   Nowshera
3  Malaika   23   Peshawar

In [87]:
#Data MAnipulation with dataframe
df['Salary']= [50000,45000,70000,80000] #Added a new column
df

      Name  Age       City  Salary
0   Areeba   22  Islamabad   50000
1  Mahnoor   20  Islamabad   45000
2    Maria   21   Nowshera   70000
3  Malaika   23   Peshawar   80000

In [88]:
df.drop('Age', axis=1) #Axis=1 will allow it to check the column wise data

      Name       City  Salary
0   Areeba  Islamabad   50000
1  Mahnoor  Islamabad   45000
2    Maria   Nowshera   70000
3  Malaika   Peshawar   80000

In [74]:
df #Age column is still there it means drop is just a temporary operation it would not affect the actual df

      Name       City  Salary
0   Areeba  Islamabad   90002
1  Mahnoor  Islamabad   85002
2    Maria   Nowshera  110002
3  Malaika   Peshawar  120002

In [90]:
df.drop('Age', axis=1, inplace=True) #if we permenantly want to del a column or element we need to use inplace= True

In [91]:
df #Now the age column is permenantly deleted

      Name       City  Salary
0   Areeba  Islamabad   50000
1  Mahnoor  Islamabad   45000
2    Maria   Nowshera   70000
3  Malaika   Peshawar   80000

In [93]:
#Add more salry to the column salary
df['Salary']=df['Salary']+2000
df

      Name       City  Salary
0   Areeba  Islamabad   52000
1  Mahnoor  Islamabad   47000
2    Maria   Nowshera   72000
3  Malaika   Peshawar   82000